# Python: Operaciones con Registros y Campos
1. Seleccionar y Filtrar
1.1. Por índices numéricos
1.2. Por variables
1.3. Según variables
2. Rellenar
3. Derivar
4. Muestra
5. Ordenar
6. Equilibrar
7. Distinguir
8. Fundir
9. Anexar
10. Intervalos
11. Partición
12. Transponer
13. Otras Operaciones
13.1. Forma
13.2. Vista previa

## 1. Seleccionar y Filtrar

In [1]:
import numpy as np
import pandas as pd

In [2]:
#Se importa Interactive Shell para visualizar varios resultados del bloque y no solo el último
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = "all"

In [3]:
df0 = pd.DataFrame([[np.nan, 2, np.nan, 0],
                    [3, 4, np.nan, 1],
                    [np.nan, np.nan, np.nan, 5],
                    [np.nan, 3, np.nan, 4]],
                    columns=list('ABCD'))

In [4]:
df0
df0.describe()
df0.mean()#también con .std(), min(), max(), mode()
df0.corr() #correlaciones
df0.shape

     A    B   C  D
0  NaN  2.0 NaN  0
1  3.0  4.0 NaN  1
2  NaN  NaN NaN  5
3  NaN  3.0 NaN  4

         A    B    C         D
count  1.0  3.0  0.0  4.000000
mean   3.0  3.0  NaN  2.500000
std    NaN  1.0  NaN  2.380476
min    3.0  2.0  NaN  0.000000
25%    3.0  2.5  NaN  0.750000
50%    3.0  3.0  NaN  2.500000
75%    3.0  3.5  NaN  4.250000
max    3.0  4.0  NaN  5.000000

A    3.0
B    3.0
C    NaN
D    2.5
dtype: float64

    A         B   C         D
A NaN       NaN NaN       NaN
B NaN  1.000000 NaN  0.240192
C NaN       NaN NaN       NaN
D NaN  0.240192 NaN  1.000000

(4, 4)

### 1.1. Por índices numéricos

In [5]:
#Por índices numéricos con función iloc
df0.iloc[:,[2-1,4-1]]#seleccionar columnas 2 y 4
df0.iloc[[2-1,4-1],:]#seleccionar filas 2 y 4 RECORDAR EMPIEZAN EN 0
df0.iloc[[2-1,4-1]] # Igual al anterior, retorna dataframe con filas pasadas como lista
df0.iloc[1:(3+1)]#Regresa dataframe con filas con índices 1 a 3
df0.iloc[1:(3+1),[3]] #regresa dataframe con filas con índice 1 a 3, y sólo la columna con índice 3. La única columna debe estar en una lista [] para dar una dataframe, de no hacerlo será un pandas series
type(df0.iloc[1:(2+1),3]) #regresa SERIE al meterse la única columna SIN ESTAR en una lista
df0[-2:] #tomar últimos dos registros

     B  D
0  2.0  0
1  4.0  1
2  NaN  5
3  3.0  4

     A    B   C  D
1  3.0  4.0 NaN  1
3  NaN  3.0 NaN  4

     A    B   C  D
1  3.0  4.0 NaN  1
3  NaN  3.0 NaN  4

     A    B   C  D
1  3.0  4.0 NaN  1
2  NaN  NaN NaN  5
3  NaN  3.0 NaN  4

   D
1  1
2  5
3  4

pandas.core.series.Series

    A    B   C  D
2 NaN  NaN NaN  5
3 NaN  3.0 NaN  4

In [6]:
#Por índices según su nombre, que podrían no ser numéricos con loc (notar es diferente a iloc)
df0.loc[[1,2]]#filas llamadas 1 y 2

     A    B   C  D
1  3.0  4.0 NaN  1
2  NaN  NaN NaN  5

### 1.2. Por índices según variable o nombres de variables

In [7]:
df0["Cedula"] = pd.Series(np.array([20,21,2,8])) #Se agrega para el ejercicio
df0["Nombre"] = pd.Series(["Juan","Esteban","Pepe","Jengibre"])#Se agrega para el ejercicio
df0

#Para establecer Cedula como índice usando loc se debe hacer el siguiente paso
df0.set_index("Nombre", inplace=True)#Notar que deja de aparecer como una variable, por lo que cambiaría la estructura de datos
df0
df0.loc[["Juan", "Pepe"],["B","C"]]
df0.loc[:,["B","C"]]
df0.loc[["Juan", "Pepe"],"B":"D"] #Como rango de columnas

df0.set_index("Cedula", inplace=True)
df0
df0.loc[[2, 8],["Nombre","B","C"]]#Notar que Nombre ya no aparece como variable al hacerse el cambio de índice

pd.DataFrame(df0,index=[2,4,5],columns=["Nombre","B","C"]) #Alternativa con nombre de índices y columnas
#VER SIGUIENTE LINEA PARA HACER SELECCION SIN AFECTAR ESTRUCTURA DE DATOS

     A    B   C  D  Cedula    Nombre
0  NaN  2.0 NaN  0      20      Juan
1  3.0  4.0 NaN  1      21   Esteban
2  NaN  NaN NaN  5       2      Pepe
3  NaN  3.0 NaN  4       8  Jengibre

            A    B   C  D  Cedula
Nombre
Juan      NaN  2.0 NaN  0      20
Esteban   3.0  4.0 NaN  1      21
Pepe      NaN  NaN NaN  5       2
Jengibre  NaN  3.0 NaN  4       8

          B   C
Nombre
Juan    2.0 NaN
Pepe    NaN NaN

            B   C
Nombre
Juan      2.0 NaN
Esteban   4.0 NaN
Pepe      NaN NaN
Jengibre  3.0 NaN

          B   C  D
Nombre
Juan    2.0 NaN  0
Pepe    NaN NaN  5

          A    B   C  D
Cedula
20      NaN  2.0 NaN  0
21      3.0  4.0 NaN  1
2       NaN  NaN NaN  5
8       NaN  3.0 NaN  4

/usr/local/src/conda3_runtime/home/envs/DSX-Python35-Spark/lib/python3.5/site-packages/ipykernel/__main__.py:14: FutureWarning:
Passing list-likes to .loc or [] with any missing label will raise
KeyError in the future, you can use .reindex() as an alternative.

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#deprecate-loc-reindex-listlike

        Nombre    B   C
Cedula
2          NaN  NaN NaN
8          NaN  3.0 NaN

   Nombre   B   C
2     NaN NaN NaN
4     NaN NaN NaN
5     NaN NaN NaN

In [8]:
#Se vuelve a crear df original
df0 = pd.DataFrame([[np.nan, 2, np.nan, 0],
                    [3, 4, np.nan, 1],
                    [np.nan, np.nan, np.nan, 5],
                    [np.nan, 3, np.nan, 4]],
                    columns=list('ABCD'))
df0["Cedula"] = pd.Series(np.array([20,21,2,8])) #Se agrega para el ejercicio
df0["Nombre"] = pd.Series(["Juan","Esteban","Pepe","Jengibre"])#Se agrega para el ejercicio
df0

     A    B   C  D  Cedula    Nombre
0  NaN  2.0 NaN  0      20      Juan
1  3.0  4.0 NaN  1      21   Esteban
2  NaN  NaN NaN  5       2      Pepe
3  NaN  3.0 NaN  4       8  Jengibre

### 1.3. Según criterio

In [9]:
df0["Nombre"]=="Juan"
type(df0["Nombre"]=="Juan")
df0.loc[df0["Nombre"]=="Juan"] #Seleccionar Nombre igual a Juan. Lo que está al interior de df0.loc es una pandas series booleana
df0.loc[df0["Nombre"]=="Juan",["B","D"]] #Seleccionar Nombre igual a Juan solo las columnas B y D. Aplica misma lógica que antes, si se selecciona una sola columna sin [] va a retornar una serie y no un dataframe
df0
df0.loc[df0["Nombre"].isin(["Juan", "Jengibre"])] #Seleccionar Nombre que sea igual a algún elemento de la lista
df0.loc[(df0["Cedula"]>20) | (df0["Nombre"]=="Pepe")] #que cumpla alguno de los dos criterios, se puede usar & como un Y
df0.loc[df0["Nombre"].str.contains("an")] #Nombres que contengan "an"

0     True
1    False
2    False
3    False
Name: Nombre, dtype: bool

pandas.core.series.Series

    A    B   C  D  Cedula Nombre
0 NaN  2.0 NaN  0      20   Juan

     B  D
0  2.0  0

     A    B   C  D  Cedula    Nombre
0  NaN  2.0 NaN  0      20      Juan
1  3.0  4.0 NaN  1      21   Esteban
2  NaN  NaN NaN  5       2      Pepe
3  NaN  3.0 NaN  4       8  Jengibre

    A    B   C  D  Cedula    Nombre
0 NaN  2.0 NaN  0      20      Juan
3 NaN  3.0 NaN  4       8  Jengibre

     A    B   C  D  Cedula   Nombre
1  3.0  4.0 NaN  1      21  Esteban
2  NaN  NaN NaN  5       2     Pepe

     A    B   C  D  Cedula   Nombre
0  NaN  2.0 NaN  0      20     Juan
1  3.0  4.0 NaN  1      21  Esteban

In [10]:
#Se puede también seleccionar según un cálculo realizado sobre una variable
#Con lambda se crea una función anónima, la cual no será asignada a ningún nombre
df0.loc[df0["Nombre"].apply(lambda x: len(x))==4] #Seleccionar registros con nombre de 4 letras. Se debe usar como función para que nombre por nombre mida el tamaño
len(df0["Nombre"])# De hacerse asi dará numero de filas de la dataframe y no el número de caracteres del nombre

    A    B   C  D  Cedula Nombre
0 NaN  2.0 NaN  0      20   Juan
2 NaN  NaN NaN  5       2   Pepe

4




## 2. Rellenar

In [11]:
df1=pd.DataFrame.copy(df0) #De hacer df1=df0, df1 va a estar haciendo referencia a df0, por lo que de cambiarse luego df1, también cambiará df0. Por esta razón para crear dataframe completamente nueva se debe usar copy
df1
df1.loc[:,["A"]] #Ver la columna A con todas las filas
df1.loc[df1["Nombre"]=="Juan", "A"]= 500 #Cambiar variable A para aquellos nombres que sean Juan por el valor 500
df1
df1.loc[df1["Nombre"].isin(["Pepe","Jengibre"]), ["B","D"]]=1234 #Cambiar varias columnas según criterio
df1

#Reemplazar también se puede
df1.replace(1234,10) #cambiar todos los 1234 por 10

     A    B   C  D  Cedula    Nombre
0  NaN  2.0 NaN  0      20      Juan
1  3.0  4.0 NaN  1      21   Esteban
2  NaN  NaN NaN  5       2      Pepe
3  NaN  3.0 NaN  4       8  Jengibre

     A
0  NaN
1  3.0
2  NaN
3  NaN

       A    B   C  D  Cedula    Nombre
0  500.0  2.0 NaN  0      20      Juan
1    3.0  4.0 NaN  1      21   Esteban
2    NaN  NaN NaN  5       2      Pepe
3    NaN  3.0 NaN  4       8  Jengibre

       A       B   C     D  Cedula    Nombre
0  500.0     2.0 NaN     0      20      Juan
1    3.0     4.0 NaN     1      21   Esteban
2    NaN  1234.0 NaN  1234       2      Pepe
3    NaN  1234.0 NaN  1234       8  Jengibre

       A     B   C   D  Cedula    Nombre
0  500.0   2.0 NaN   0      20      Juan
1    3.0   4.0 NaN   1      21   Esteban
2    NaN  10.0 NaN  10       2      Pepe
3    NaN  10.0 NaN  10       8  Jengibre

In [12]:
#Antes se crea nueva variable para hacer operaciones
df0["Ingresos"]=[1000,1100,5000,3000]# Al ser reemplazada una pandas series se puede agregar así o con pd.Series() y la lista adentro
type(df0["Ingresos"])
type(df0[["A", "B"]])
pd.DataFrame([[500,200,20000,35000],[300,400,500,600]]).transpose()

#Agregar varias columnas
df0[["Activos", "Pasivos"]]= pd.DataFrame([[500,200,20000,35000],[300,400,500,600]]).transpose()
df0

#Rellenar varias columnas. Utilizando como criterio Siempre
df0[["Activos", "Pasivos"]]=df0[["Activos", "Pasivos"]]*0.16 #Se cambian dos columnas por su 16%
df0

#Rellenar varias columnas. Utilizando "En función de una condición"
df0.loc[(df0["Cedula"]>=20),["Activos", "Pasivos"]] = df0[["Activos","Pasivos"]]*20 #Multiplicar por 20 activos y pasivos de personas con una cédula con valor igual o superior a 20
df0

pandas.core.series.Series

pandas.core.frame.DataFrame

       0    1
0    500  300
1    200  400
2  20000  500
3  35000  600

     A    B   C  D  Cedula    Nombre  Ingresos  Activos  Pasivos
0  NaN  2.0 NaN  0      20      Juan      1000      500      300
1  3.0  4.0 NaN  1      21   Esteban      1100      200      400
2  NaN  NaN NaN  5       2      Pepe      5000    20000      500
3  NaN  3.0 NaN  4       8  Jengibre      3000    35000      600

     A    B   C  D  Cedula    Nombre  Ingresos  Activos  Pasivos
0  NaN  2.0 NaN  0      20      Juan      1000     80.0     48.0
1  3.0  4.0 NaN  1      21   Esteban      1100     32.0     64.0
2  NaN  NaN NaN  5       2      Pepe      5000   3200.0     80.0
3  NaN  3.0 NaN  4       8  Jengibre      3000   5600.0     96.0

     A    B   C  D  Cedula    Nombre  Ingresos  Activos  Pasivos
0  NaN  2.0 NaN  0      20      Juan      1000   1600.0    960.0
1  3.0  4.0 NaN  1      21   Esteban      1100    640.0   1280.0
2  NaN  NaN NaN  5       2      Pepe      5000   3200.0     80.0
3  NaN  3.0 NaN  4       8  Jengibre      3000   5600.0     96.0

In [13]:
df0 = pd.DataFrame([[np.nan, 2, np.nan, np.nan],
                    [2, 4, np.nan, 1],
                    [np.nan, np.nan, np.nan, 5],
                    [np.nan, 3, np.nan, 4]],
                    columns=list('ABCD'))

In [14]:
#Rellenar valores nulos de ciertas columnas con 0
df1=pd.DataFrame.copy(df0)#Crear dataframe copia de df0
df1
df1[["A","B"]].isna().any(axis=0)# Ver si hay algún NA en las columnas A y B. Es una pandas series
df1[["A","B"]].isna().any(axis=1)#Ver filas con algún na en la columna A o B. Se toma la dataframe con solo estas dos columnas, se reemplazan valores por True o False dependiendo si son NA, y se mira si alguno es true
~df1[["A","B"]].isna().all(axis=1) #Ver si todos son NO nulos. notar el "~"

df1.loc[df1[["B"]].isna().any(axis=1),["B"]] = df1["B"].mean()#Forma de imputar datos faltantes en una columna por su media, no es compacta
df1.fillna(df1.mean())#imputar todas las columnas con la media. Se puede con otra función siempre y cuando se ingrese como pd.Series un valor por cada columna
df1.mean()
type(df1.mean())

#   df1.dropna() # para eliminar filas con na

     A    B   C    D
0  NaN  2.0 NaN  NaN
1  2.0  4.0 NaN  1.0
2  NaN  NaN NaN  5.0
3  NaN  3.0 NaN  4.0

A    True
B    True
dtype: bool

0     True
1    False
2     True
3     True
dtype: bool

0     True
1     True
2    False
3     True
dtype: bool

     A    B   C         D
0  2.0  2.0 NaN  3.333333
1  2.0  4.0 NaN  1.000000
2  2.0  3.0 NaN  5.000000
3  2.0  3.0 NaN  4.000000

A    2.000000
B    3.000000
C         NaN
D    3.333333
dtype: float64

pandas.core.series.Series

## 3. Derivar

In [15]:
df0["Ingresos"]=[1000,2100,1500,3000]# Al ser reemplazada una pandas series se puede agregar así o con pd.Series() y la lista adentro
df0
df0["Variable_nueva"] = df0["Ingresos"]*2
df0
df0[["Varnueva2","Varnueva3"]]=df0[["B","Ingresos"]]/2 #Varias nuevas con la misma función. Tomar la mitad de B y mitad de Ingresos y llamarlas varnueva2 y varnueva3
df0

     A    B   C    D  Ingresos
0  NaN  2.0 NaN  NaN      1000
1  2.0  4.0 NaN  1.0      2100
2  NaN  NaN NaN  5.0      1500
3  NaN  3.0 NaN  4.0      3000

     A    B   C    D  Ingresos  Variable_nueva
0  NaN  2.0 NaN  NaN      1000            2000
1  2.0  4.0 NaN  1.0      2100            4200
2  NaN  NaN NaN  5.0      1500            3000
3  NaN  3.0 NaN  4.0      3000            6000

     A    B   C    D  Ingresos  Variable_nueva  Varnueva2  Varnueva3
0  NaN  2.0 NaN  NaN      1000            2000        1.0        500
1  2.0  4.0 NaN  1.0      2100            4200        2.0       1050
2  NaN  NaN NaN  5.0      1500            3000        NaN        750
3  NaN  3.0 NaN  4.0      3000            6000        1.5       1500

In [16]:
#Con un condicional
prueba=df0["Ingresos"]<1600 #Condición almacenada como Pandas Series
#type(prueba)#Pandas Series
df0.loc[prueba, "Var4"]="Categoria 1" #En caso de cumplir
df0.loc[~prueba,"Var4"]="Categoria 2" #En caso de no cumplir, se invierten valores de boolean pandas series con el signo "~"
df0

#También se puede con la siguiente función, donde el primer argumento es para especificar la ubicación de la nueva columna
df0.insert(0,'copia_de_Ingresos', df0['Ingresos']) #el primer argumento es para especificar la ubicación de la nueva columna
df0

,A,B,C,D,Ingresos,Variable_nueva,Varnueva2,Varnueva3,Var4
0,NaN,2.0,NaN,NaN,1000,2000,1.0,500,Categoria 1
1,2.0,4.0,NaN,1.0,2100,4200,2.0,1050,Categoria 2
2,NaN,NaN,NaN,5.0,1500,3000,NaN,750,Categoria 1
3,NaN,3.0,NaN,4.0,3000,6000,1.5,1500,Categoria 2

,copia_de_Ingresos,A,B,C,D,Ingresos,Variable_nueva,Varnueva2,Varnueva3,Var4
0,1000,NaN,2.0,NaN,NaN,1000,2000,1.0,500,Categoria 1
1,2100,2.0,4.0,NaN,1.0,2100,4200,2.0,1050,Categoria 2
2,1500,NaN,NaN,NaN,5.0,1500,3000,NaN,750,Categoria 1
3,3000,NaN,3.0,NaN,4.0,3000,6000,1.5,1500,Categoria 2

In [17]:
#Recuento

#Se define función para contar
valor_inicial=0 #Definir valor inicial
paso=2 #Definir paso

#Se define función acumulador usando como entrada una lista
def acumulador(lista):
    total=valor_inicial #valor
    
    for x in lista:
        if (x <1600):
            total+=paso
            yield total
        else:
            yield valor_inicial
        
lista2=df0["Ingresos"].values.tolist()
lista2
list(acumulador(lista2))
#list(acumulador([1,2,3,4]))

[1000, 2100, 1500, 3000]

[2, 0, 4, 0]

## 4. Muestra

In [18]:
df1 =  pd.DataFrame(np.random.randn(100, 4), columns=list('ABCD')) #dataframe con 4 columnas y 100 registros aleatorios con distribución normal
pesos = pd.Series(range(1,101)) #Serie empezando en 1 y terminando en 100
#pesos
#DataFrame.sample(n=None, frac=None, replace=False, weights=None, random_state=None, axis=None)
# https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.sample.html

df1.sample(5)# 5 aleatorios
df1.sample(n=10,replace=True)# 10 registros con posibilidad de reemplazamiento
df1.sample(frac=0.05)#5% de los registros. De no coincidir exactamente se aproximará al valor más cercano
df1.sample(5, random_state=200)# Semilla igual a 200 para hacer muestra pseudoaleatoria y garantizar replicación
df1.sample(n=2,axis=1)# Para tomar dos columnas aleatorias
df1.sample(n=10, weights=pesos, replace=True)#Dándole pesos, notar entre más grande el índice mayor la probabilidad en este caso

           A         B         C         D
3  -0.979689 -0.401245  0.384039  1.100147
81 -0.360399 -0.041960 -1.403892  0.531917
94  1.460975  0.837088 -0.203524  0.097242
46 -0.245814 -0.653534 -0.678005 -1.006977
10  2.132101  0.254168  0.079209  2.141527

           A         B         C         D
4  -0.284033  1.115581  0.043039  0.881393
46 -0.245814 -0.653534 -0.678005 -1.006977
29  0.195814 -1.166887  0.075661  1.926856
46 -0.245814 -0.653534 -0.678005 -1.006977
84 -1.123880 -0.960755  0.631535 -0.940292
78 -0.289271 -0.457588 -0.672811 -0.695561
63 -0.721907 -0.617200 -0.608174 -0.340344
58 -0.611108 -0.311843  0.935054 -0.070954
43 -0.755401 -0.081904  0.072763  0.683441
49  0.507801 -0.824944 -1.049721  1.158368

           A         B         C         D
2   0.055969 -1.579678  0.240952 -0.144257
27 -1.955459  0.638861  1.858856 -0.813325
87 -1.380494 -0.084725 -1.700712  2.366907
77 -0.306832 -0.700624  0.228686 -0.487807
51  0.147307  0.502849  1.453051  0.527884

           A         B         C         D
34  0.102027  0.066173  0.561444  0.132480
2   0.055969 -1.579678  0.240952 -0.144257
72  1.288475  0.609272 -0.443475 -0.742915
37  0.311532  0.913476  0.749068  0.134326
86 -0.820151  0.541801 -0.397516 -0.174174

           D         C
0   0.648023  1.489259
1   0.048788  0.395437
2  -0.144257  0.240952
3   1.100147  0.384039
4   0.881393  0.043039
5  -0.758431 -0.895052
6  -0.636581  0.660084
7  -0.395367  0.285199
8   0.780412  0.223272
9  -1.698745 -0.568131
10  2.141527  0.079209
11 -1.412809  0.798402
12  0.313614  0.077769
13  0.484531  1.063760
14 -0.054744  0.788453
15  2.819100  0.128987
16 -0.450024 -0.706012
17 -1.009143 -0.587806
18  0.774515  0.360717
19 -0.142191 -1.151786
20 -0.513114  0.876786
21 -1.355634  0.804325
22 -0.807533 -0.632549
23  0.311910 -0.954202
24 -0.276206  0.597994
25  0.845116  1.546611
26  0.842322 -0.205039
27 -0.813325  1.858856
28  1.070477  1.208916
29  1.926856  0.075661
..       ...       ...
70 -0.169875 -1.373162
71  1.674352 -0.179405
72 -0.742915 -0.443475
73 -0.188620  0.135399
74 -0.736800  1.142164
75  1.416570 -0.903681
76 -1.689858 -0.823162
77 -0.487807  0.228686
78 -0.695561 -0.672811
79 -0.584523 -0.083464
80  1.127083 -0.281946
81  0.531917 -1.403892
82  0.273946 -0.393641
83  0.865709 -0.882519
84 -0.940292  0.631535
85 -1.547190  0.581131
86 -0.174174 -0.397516
87  2.366907 -1.700712
88 -0.542706 -0.573407
89  0.546963 -0.104610
90 -0.685382  0.812602
91  0.503730  0.047751
92 -1.902619  1.015693
93  1.225933  0.077003
94  0.097242 -0.203524
95 -0.901604 -0.429746
96 -0.417224 -1.878524
97  0.477566  0.904087
98  0.289052  0.549112
99 -0.492248 -0.536980

[100 rows x 2 columns]

           A         B         C         D
52 -1.143786  1.277108 -1.574606 -0.014848
67  0.375080 -0.024636 -1.022003  0.760330
98  0.604749 -1.040649  0.549112  0.289052
84 -1.123880 -0.960755  0.631535 -0.940292
24 -0.865857 -1.993732  0.597994 -0.276206
94  1.460975  0.837088 -0.203524  0.097242
36 -1.387369  0.216926 -0.441867 -0.329722
61 -0.303865 -0.545799  0.721028  1.082903
14 -2.412816  0.568203  0.788453 -0.054744
72  1.288475  0.609272 -0.443475 -0.742915

In [19]:
#Muestra de las primeras n filas
n=5
df1.head(n)
df1.iloc[0::5,:]#la primera y cada uno con índice que es múltiplo de 5
df1[df1.index % 5==0] #Igual al caso anterior, si el residuo de la división es 0
df1[df1.index % 5!=0] #Sacando el primero y múltiplos de 5. Caso contrario al anterior

          A         B         C         D
0 -1.605878 -0.308693  1.489259  0.648023
1  0.127310  1.253033  0.395437  0.048788
2  0.055969 -1.579678  0.240952 -0.144257
3 -0.979689 -0.401245  0.384039  1.100147
4 -0.284033  1.115581  0.043039  0.881393

           A         B         C         D
0  -1.605878 -0.308693  1.489259  0.648023
5   0.326295 -0.789287 -0.895052 -0.758431
10  2.132101  0.254168  0.079209  2.141527
15 -0.263352 -0.643587  0.128987  2.819100
20  1.667128 -0.816894  0.876786 -0.513114
25  2.283286  0.621918  1.546611  0.845116
30 -0.227174 -0.392056  1.692662  0.668766
35 -1.585287  0.336675  1.017687 -0.400518
40  0.146597  0.698030 -0.102819 -0.412526
45  1.512241  0.075762  0.468267 -0.306745
50 -0.715827  0.643756  0.929229 -0.910056
55 -1.715667  2.087216 -0.361029 -0.829719
60  0.407454 -1.946548  0.252324  1.109254
65 -0.532224  1.996273  1.193366  0.463770
70  0.808744 -0.612829 -1.373162 -0.169875
75 -0.568391  1.420362 -0.903681  1.416570
80 -0.634643 -0.033255 -0.281946  1.127083
85 -0.367356  0.334255  0.581131 -1.547190
90  0.222857 -0.819378  0.812602 -0.685382
95  0.365438 -0.399441 -0.429746 -0.901604

           A         B         C         D
0  -1.605878 -0.308693  1.489259  0.648023
5   0.326295 -0.789287 -0.895052 -0.758431
10  2.132101  0.254168  0.079209  2.141527
15 -0.263352 -0.643587  0.128987  2.819100
20  1.667128 -0.816894  0.876786 -0.513114
25  2.283286  0.621918  1.546611  0.845116
30 -0.227174 -0.392056  1.692662  0.668766
35 -1.585287  0.336675  1.017687 -0.400518
40  0.146597  0.698030 -0.102819 -0.412526
45  1.512241  0.075762  0.468267 -0.306745
50 -0.715827  0.643756  0.929229 -0.910056
55 -1.715667  2.087216 -0.361029 -0.829719
60  0.407454 -1.946548  0.252324  1.109254
65 -0.532224  1.996273  1.193366  0.463770
70  0.808744 -0.612829 -1.373162 -0.169875
75 -0.568391  1.420362 -0.903681  1.416570
80 -0.634643 -0.033255 -0.281946  1.127083
85 -0.367356  0.334255  0.581131 -1.547190
90  0.222857 -0.819378  0.812602 -0.685382
95  0.365438 -0.399441 -0.429746 -0.901604

           A         B         C         D
1   0.127310  1.253033  0.395437  0.048788
2   0.055969 -1.579678  0.240952 -0.144257
3  -0.979689 -0.401245  0.384039  1.100147
4  -0.284033  1.115581  0.043039  0.881393
6  -0.517947 -0.546250  0.660084 -0.636581
7  -2.755493 -0.675249  0.285199 -0.395367
8   0.068657 -1.589982  0.223272  0.780412
9  -1.101715 -0.385126 -0.568131 -1.698745
11 -1.175627  0.718741  0.798402 -1.412809
12 -0.815450 -0.336959  0.077769  0.313614
13  0.253312 -0.498412  1.063760  0.484531
14 -2.412816  0.568203  0.788453 -0.054744
16  1.359310  0.378142 -0.706012 -0.450024
17 -1.002286  0.254658 -0.587806 -1.009143
18  0.404961  1.562185  0.360717  0.774515
19 -1.740454  0.742075 -1.151786 -0.142191
21  0.351619 -0.835987  0.804325 -1.355634
22  1.161508 -1.099341 -0.632549 -0.807533
23 -1.221176 -1.334553 -0.954202  0.311910
24 -0.865857 -1.993732  0.597994 -0.276206
26  0.838034 -0.110971 -0.205039  0.842322
27 -1.955459  0.638861  1.858856 -0.813325
28 -0.873813  1.736340  1.208916  1.070477
29  0.195814 -1.166887  0.075661  1.926856
31  1.635296 -1.367605  1.684811 -1.128734
32  1.164956 -0.636362  0.849301  0.868564
33 -0.304857 -0.812428  0.358984  0.804204
34  0.102027  0.066173  0.561444  0.132480
36 -1.387369  0.216926 -0.441867 -0.329722
37  0.311532  0.913476  0.749068  0.134326
..       ...       ...       ...       ...
63 -0.721907 -0.617200 -0.608174 -0.340344
64 -0.715828 -0.353532 -0.107312  0.833493
66 -1.150299  0.846795  0.133829 -0.311836
67  0.375080 -0.024636 -1.022003  0.760330
68 -0.675480  1.306041 -0.760395 -0.258639
69  0.324163  0.006016  2.634983  1.470186
71 -0.143055  2.247025 -0.179405  1.674352
72  1.288475  0.609272 -0.443475 -0.742915
73  0.896468  0.727205  0.135399 -0.188620
74 -0.775033 -0.628606  1.142164 -0.736800
76 -1.851981 -1.866856 -0.823162 -1.689858
77 -0.306832 -0.700624  0.228686 -0.487807
78 -0.289271 -0.457588 -0.672811 -0.695561
79  0.781004  0.798985 -0.083464 -0.584523
81 -0.360399 -0.041960 -1.403892  0.531917
82 -1.053868 -1.281061 -0.393641  0.273946
83 -0.639755 -1.664843 -0.882519  0.865709
84 -1.123880 -0.960755  0.631535 -0.940292
86 -0.820151  0.541801 -0.397516 -0.174174
87 -1.380494 -0.084725 -1.700712  2.366907
88  1.022480  0.290512 -0.573407 -0.542706
89  1.157037 -1.919218 -0.104610  0.546963
91  0.460514 -1.244324  0.047751  0.503730
92  0.906427  1.087807  1.015693 -1.902619
93 -0.000086 -1.625863  0.077003  1.225933
94  1.460975  0.837088 -0.203524  0.097242
96  0.886416 -0.122412 -1.878524 -0.417224
97  0.856855  1.318905  0.904087  0.477566
98  0.604749 -1.040649  0.549112  0.289052
99  1.380309 -0.806758 -0.536980 -0.492248

[80 rows x 4 columns]

## 5. Ordenar

In [20]:
# http://pandas.pydata.org/pandas-docs/version/0.19/generated/pandas.DataFrame.sort_values.html#pandas.DataFrame.sort_values
# DataFrame.sort_values(by, axis=0, ascending=True, inplace=False, kind='quicksort', na_position='last')

#Se crea dataframe para ejemplo
df1 = pd.DataFrame(np.random.randint(0,10,size=(20, 4)), columns=list('ABCD'))
df1.loc[df1.index<6]=np.nan #Se le asigna valores nulos a las primeras 6 filas, con índice menor a 6

#Se organizan según B y luego según C
df1.sort_values(by=["B","C"], ascending=False, inplace=True) #ordenando primero por columna B, y en caso de tener el mismo valor, según columna C. Notar NaN por defecto al final
#Con inplace= True como parámetro, se puede hacer que se reemplace la df original
df1

#Y si queremos actualizar los indices
df1 = df1.reset_index(drop=True)
df1

      A    B    C    D
16  3.0  9.0  8.0  1.0
6   8.0  8.0  7.0  8.0
12  6.0  8.0  5.0  9.0
19  6.0  7.0  6.0  2.0
15  8.0  6.0  7.0  7.0
13  8.0  6.0  2.0  8.0
10  0.0  4.0  5.0  4.0
9   7.0  3.0  4.0  8.0
17  4.0  2.0  7.0  1.0
7   9.0  1.0  7.0  9.0
8   4.0  1.0  5.0  7.0
11  1.0  1.0  4.0  6.0
14  2.0  0.0  7.0  1.0
18  9.0  0.0  6.0  3.0
0   NaN  NaN  NaN  NaN
1   NaN  NaN  NaN  NaN
2   NaN  NaN  NaN  NaN
3   NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN

      A    B    C    D
0   3.0  9.0  8.0  1.0
1   8.0  8.0  7.0  8.0
2   6.0  8.0  5.0  9.0
3   6.0  7.0  6.0  2.0
4   8.0  6.0  7.0  7.0
5   8.0  6.0  2.0  8.0
6   0.0  4.0  5.0  4.0
7   7.0  3.0  4.0  8.0
8   4.0  2.0  7.0  1.0
9   9.0  1.0  7.0  9.0
10  4.0  1.0  5.0  7.0
11  1.0  1.0  4.0  6.0
12  2.0  0.0  7.0  1.0
13  9.0  0.0  6.0  3.0
14  NaN  NaN  NaN  NaN
15  NaN  NaN  NaN  NaN
16  NaN  NaN  NaN  NaN
17  NaN  NaN  NaN  NaN
18  NaN  NaN  NaN  NaN
19  NaN  NaN  NaN  NaN

## 6. Equilibrar

In [21]:
import random
random.seed(123)#Semilla para replicar resultados

#Creación dataframe
df1 = pd.DataFrame(np.random.randint(0,10,size=(20, 4)), columns=list('ABCD'))
diferenciador=df1["A"]<3
df1.loc[diferenciador, ["A"]]="Categoria1"
df1.loc[~diferenciador, ["A"]]="Categoria2" #Caso opuesto a diferenciador
#df1 #Ver la dataframe original

#Ver registros por categoría
##df1.groupby("A").count() #Ver cuantos registros hay por cada categoría
conteo=df1["A"].value_counts()
conteo

#Obtener factor entre el mayor y el menor
def vermayor (a,b):
    if (a>b):
        Muestra=a-b
    elif (b>a):
        Muestra=b-a
    else:
        Muestra = "Balanceados"
    return Muestra
muestra1 = vermayor(conteo[0],conteo[1])
print("La muestra a obtener para la menor categoría es:" + str(muestra1))

#Filtrar casos a remuestrear (categoría menor)
if (conteo[0]>conteo[1]):
    indice=1
elif (conteo[1]>conteo[0]):
    indice=0
else:
    indice= "no requiere"

conteo.index[0]    
df_a_muestrear_upsampling = df1.loc[df1["A"]==conteo.index[indice]]
df_a_muestrear_downsampling = df1.loc[df1["A"]==conteo.index[abs(1-indice)]]

#df_a_muestrear_upsampling
#df_a_muestrear_downsampling

#Cargar libreria
from sklearn.utils import resample
from imblearn.over_sampling import RandomOverSampler 


#UPSAMPLING
print("UPSAMPLING")
#http://scikit-learn.org/stable/modules/generated/sklearn.utils.resample.html
nuevamuestra = resample(df_a_muestrear_upsampling, n_samples=muestra1)
nuevamuestra
#Agregar valores a la df anterior y nombrarla df3
df3 = df1.append(nuevamuestra)
df3

#DOWNSAMPLING
print("DOWNSAMPLING")
nuevamuestradown = resample(df_a_muestrear_downsampling, n_samples=conteo[abs(1-indice)]-muestra1, replace= False)#Valores a escoger, los demás serán eliminados
nuevamuestradown

#Crear nuevadataframe balanceada
df4 = df_a_muestrear_upsampling.append(nuevamuestradown)
df4

Categoria2    13
Categoria1     7
Name: A, dtype: int64

La muestra a obtener para la menor categoría es:6

'Categoria2'

UPSAMPLING

             A  B  C  D
6   Categoria1  4  6  9
8   Categoria1  9  7  2
10  Categoria1  3  7  5
5   Categoria1  1  9  0
6   Categoria1  4  6  9
6   Categoria1  4  6  9

             A  B  C  D
0   Categoria2  6  4  0
1   Categoria2  2  8  2
2   Categoria2  6  5  4
3   Categoria1  3  4  6
4   Categoria2  6  3  0
5   Categoria1  1  9  0
6   Categoria1  4  6  9
7   Categoria2  7  5  8
8   Categoria1  9  7  2
9   Categoria2  1  0  2
10  Categoria1  3  7  5
11  Categoria2  1  7  8
12  Categoria2  9  2  4
13  Categoria1  2  4  7
14  Categoria2  5  8  2
15  Categoria2  0  0  2
16  Categoria2  3  9  0
17  Categoria2  7  9  1
18  Categoria2  9  5  3
19  Categoria1  9  1  8
6   Categoria1  4  6  9
8   Categoria1  9  7  2
10  Categoria1  3  7  5
5   Categoria1  1  9  0
6   Categoria1  4  6  9
6   Categoria1  4  6  9

DOWNSAMPLING

             A  B  C  D
9   Categoria2  1  0  2
18  Categoria2  9  5  3
0   Categoria2  6  4  0
11  Categoria2  1  7  8
17  Categoria2  7  9  1
15  Categoria2  0  0  2
14  Categoria2  5  8  2

             A  B  C  D
3   Categoria1  3  4  6
5   Categoria1  1  9  0
6   Categoria1  4  6  9
8   Categoria1  9  7  2
10  Categoria1  3  7  5
13  Categoria1  2  4  7
19  Categoria1  9  1  8
9   Categoria2  1  0  2
18  Categoria2  9  5  3
0   Categoria2  6  4  0
11  Categoria2  1  7  8
17  Categoria2  7  9  1
15  Categoria2  0  0  2
14  Categoria2  5  8  2

In [22]:
#PENDIENTE PROBAR
#http://contrib.scikit-learn.org/imbalanced-learn/stable/auto_examples/over-sampling/plot_random_over_sampling.html
#http://contrib.scikit-learn.org/imbalanced-learn/stable/over_sampling.html
from sklearn.utils import resample
from imblearn.over_sampling import RandomOverSampler 
#ros1 = RandomOverSampler()
#X = df1.loc[:, df1.columns!="A"]
#Y = np.ravel(df1["A"])

In [23]:
#SMOTE
#!pip install imblearn
#from sklearn.datasets import make_classification
#from imblearn.over_sampling import SMOTE

## 7. Distinguir

In [73]:
# Se crea data frame para ejemplo
df_prueba = pd.DataFrame(np.random.randint(0,3,size = (20,8)), columns=list('ABCDEFGH'))
df_prueba

    A  B  C  D  E  F  G  H
0   1  2  2  1  2  0  0  2
1   1  0  2  1  2  0  2  1
2   0  0  0  0  2  0  1  2
3   1  0  1  2  1  0  2  2
4   0  2  1  2  1  2  1  1
5   1  0  2  2  2  1  1  1
6   0  0  1  1  2  0  0  2
7   2  1  2  1  1  2  2  0
8   2  1  0  1  2  0  1  1
9   2  1  0  2  0  0  1  0
10  2  2  0  2  0  2  2  1
11  0  2  1  2  1  2  0  2
12  1  1  2  0  0  0  0  1
13  2  1  1  2  0  0  1  2
14  2  0  2  1  1  0  0  2
15  1  1  2  2  0  1  0  2
16  2  0  0  2  2  1  1  2
17  1  1  1  0  2  1  2  1
18  2  0  1  1  0  2  1  0
19  0  2  1  2  1  1  1  2

In [74]:
#Valores únicos de una columna
df_prueba["A"].unique()
#Contar cuantos son
len(df_prueba["A"].unique())

#Eliminar duplicados dejando solo el primero y considerando únicamente la columna A. inplace es False para no reemplazar la df original
#https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.drop_duplicates.html
df_prueba.drop_duplicates(subset=["A","B"],keep="first", inplace=False)
#df_prueba.loc[:,["A"]].drop_duplicates()

array([1, 0, 2])

3

    A  B  C  D  E  F  G  H
0   1  2  2  1  2  0  0  2
1   1  0  2  1  2  0  2  1
2   0  0  0  0  2  0  1  2
4   0  2  1  2  1  2  1  1
7   2  1  2  1  1  2  2  0
10  2  2  0  2  0  2  2  1
12  1  1  2  0  0  0  0  1
14  2  0  2  1  1  0  0  2

In [77]:
df_nueva = df_prueba.groupby(["A","B"]).mean()
df_nueva
#Se evita las variables según las cuales se distinguieron sean los nuevos índices. Se vuelven columnas nuevamente
df_nueva.reset_index(inplace=True)
df_nueva

#Para más alternativas ver Agregar más adelante

            C         D         E         F         G         H
A B
0 0  0.500000  0.500000  2.000000  0.000000  0.500000  2.000000
  2  1.000000  2.000000  1.000000  1.666667  0.666667  1.666667
1 0  1.666667  1.666667  1.666667  0.333333  1.666667  1.333333
  1  1.666667  0.666667  0.666667  0.666667  0.666667  1.333333
  2  2.000000  1.000000  2.000000  0.000000  0.000000  2.000000
2 0  1.000000  1.333333  1.000000  1.000000  0.666667  1.333333
  1  0.750000  1.500000  0.750000  0.500000  1.250000  0.750000
  2  0.000000  2.000000  0.000000  2.000000  2.000000  1.000000

   A  B         C         D         E         F         G         H
0  0  0  0.500000  0.500000  2.000000  0.000000  0.500000  2.000000
1  0  2  1.000000  2.000000  1.000000  1.666667  0.666667  1.666667
2  1  0  1.666667  1.666667  1.666667  0.333333  1.666667  1.333333
3  1  1  1.666667  0.666667  0.666667  0.666667  0.666667  1.333333
4  1  2  2.000000  1.000000  2.000000  0.000000  0.000000  2.000000
5  2  0  1.000000  1.333333  1.000000  1.000000  0.666667  1.333333
6  2  1  0.750000  1.500000  0.750000  0.500000  1.250000  0.750000
7  2  2  0.000000  2.000000  0.000000  2.000000  2.000000  1.000000

## 8. Fundir

In [26]:
#Se crean base de datos para ejemplo junto a la base de datos df_prueba utilizada en distinguir

#Recordar instalar names la primera vez
#!pip install names
import names
names.get_full_name() #Ejemplo nombre aleatorio
np.arange(3,13,1)

nombres = []
nombres2= []
for i in range(10):
    nombres.append(names.get_full_name())
    nombres2.append(names.get_full_name())

df_detalle = pd.DataFrame([np.arange(3,13,1),
                         nombres, nombres2]).T
df_detalle.columns = ["ID", "Nombre1", "Nombre2"]
df_detalle

'Christopher Dryer'

array([ 3,  4,  5,  6,  7,  8,  9, 10, 11, 12])

   ID            Nombre1            Nombre2
0   3  Margaret Wigfield        Kevin North
1   4      Stefanie Cook       April Jerome
2   5        James Morse         Nick Brock
3   6       George Horne      Robert Turner
4   7       Mark Shannon  Virginia Frerichs
5   8     Teresa Mendosa       Elmer Crider
6   9        Mary Bakley      Marcia Prieto
7  10      Sylvia Hardin    Clayton Arteaga
8  11      Israel Luster      Steven Lanier
9  12     Joel Underwood         Mary Coles

Código genérico de merge
https://pandas.pydata.org/pandas-docs/stable/merging.html ver a mitad de página

pd.merge(left, right, how='inner', on=None, left_on=None, right_on=None,
         left_index=False, right_index=False, sort=True,
         suffixes=('_x', '_y'), copy=True, indicator=False,
         validate=None)

In [27]:
pd.merge(df_detalle, df_prueba, how='outer', on=None, left_on="ID", right_on="A",
         left_index=False, right_index=True, sort=False,
         suffixes=('_x', '_y'), copy=True, indicator=False,
         validate=None)

     ID            Nombre1            Nombre2  A  B  C  D  E  F  G  H
0   3.0  Margaret Wigfield        Kevin North  8  2  7  6  7  6  3  5
1   4.0      Stefanie Cook       April Jerome  0  8  5  9  2  7  5  6
2   5.0        James Morse         Nick Brock  3  6  2  7  6  3  9  8
3   6.0       George Horne      Robert Turner  9  8  8  7  7  4  2  7
4   7.0       Mark Shannon  Virginia Frerichs  1  9  5  6  1  6  2  2
5   8.0     Teresa Mendosa       Elmer Crider  7  2  3  3  1  3  9  6
6   9.0        Mary Bakley      Marcia Prieto  4  8  9  3  1  7  4  3
7  10.0      Sylvia Hardin    Clayton Arteaga  4  4  2  7  2  8  2  7
8  11.0      Israel Luster      Steven Lanier  8  2  6  1  3  0  5  7
9  12.0     Joel Underwood         Mary Coles  7  4  7  8  5  2  7  5
9   0.0                NaN                NaN  4  0  2  6  4  4  0  2
9   1.0                NaN                NaN  8  6  9  3  5  5  4  7
9   2.0                NaN                NaN  8  6  4  1  3  7  0  0
9  13.0                NaN                NaN  6  5  6  8  9  6  4  5
9  14.0                NaN                NaN  0  5  1  8  0  9  9  1
9  15.0                NaN                NaN  7  4  1  4  1  7  8  9
9  16.0                NaN                NaN  2  7  9  3  9  3  9  7
9  17.0                NaN                NaN  6  7  1  2  1  1  7  5
9  18.0                NaN                NaN  3  5  2  4  8  5  2  0
9  19.0                NaN                NaN  2  5  9  1  2  8  4  2

In [28]:
pd.merge(df_detalle, df_prueba, how='inner', on=None, left_on="ID", right_on="A",
         left_index=False, right_index=False, sort=True,
         suffixes=('_x', '_y'), copy=True, indicator=False,
         validate=None)

   ID            Nombre1            Nombre2  A  B  C  D  E  F  G  H
0   3  Margaret Wigfield        Kevin North  3  6  2  7  6  3  9  8
1   3  Margaret Wigfield        Kevin North  3  5  2  4  8  5  2  0
2   4      Stefanie Cook       April Jerome  4  0  2  6  4  4  0  2
3   4      Stefanie Cook       April Jerome  4  8  9  3  1  7  4  3
4   4      Stefanie Cook       April Jerome  4  4  2  7  2  8  2  7
5   6       George Horne      Robert Turner  6  5  6  8  9  6  4  5
6   6       George Horne      Robert Turner  6  7  1  2  1  1  7  5
7   7       Mark Shannon  Virginia Frerichs  7  2  3  3  1  3  9  6
8   7       Mark Shannon  Virginia Frerichs  7  4  7  8  5  2  7  5
9   7       Mark Shannon  Virginia Frerichs  7  4  1  4  1  7  8  9
10  8     Teresa Mendosa       Elmer Crider  8  6  9  3  5  5  4  7
11  8     Teresa Mendosa       Elmer Crider  8  6  4  1  3  7  0  0
12  8     Teresa Mendosa       Elmer Crider  8  2  7  6  7  6  3  5
13  8     Teresa Mendosa       Elmer Crider  8  2  6  1  3  0  5  7
14  9        Mary Bakley      Marcia Prieto  9  8  8  7  7  4  2  7

In [29]:
pd.merge(df_detalle, df_prueba, how='left', on=None, left_on="ID", right_on="A",
         left_index=False, right_index=False, sort=False,
         suffixes=('_x', '_y'), copy=True, indicator=True,
         validate="one_to_many")

#Se puede cambiar validate a "one_to_one" en caso de querese verificar las correspondencias sean uno a uno
#Con indicator = True se agrega una columna que permite conocer cuáles valores están en la primera, segunda o en ambos sets de datos

,ID,Nombre1,Nombre2,A,B,C,D,E,F,G,H,_merge
0,3,Margaret Wigfield,Kevin North,3.0,6.0,2.0,7.0,6.0,3.0,9.0,8.0,both
1,3,Margaret Wigfield,Kevin North,3.0,5.0,2.0,4.0,8.0,5.0,2.0,0.0,both
2,4,Stefanie Cook,April Jerome,4.0,0.0,2.0,6.0,4.0,4.0,0.0,2.0,both
3,4,Stefanie Cook,April Jerome,4.0,8.0,9.0,3.0,1.0,7.0,4.0,3.0,both
4,4,Stefanie Cook,April Jerome,4.0,4.0,2.0,7.0,2.0,8.0,2.0,7.0,both
5,5,James Morse,Nick Brock,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,left_only
6,6,George Horne,Robert Turner,6.0,5.0,6.0,8.0,9.0,6.0,4.0,5.0,both
7,6,George Horne,Robert Turner,6.0,7.0,1.0,2.0,1.0,1.0,7.0,5.0,both
8,7,Mark Shannon,Virginia Frerichs,7.0,2.0,3.0,3.0,1.0,3.0,9.0,6.0,both
9,7,Mark Shannon,Virginia Frerichs,7.0,4.0,7.0,8.0,5.0,2.0,7.0,5.0,both
10,7,Mark Shannon,Virginia Frerichs,7.0,4.0,1.0,4.0,1.0,7.0,8.0,9.0,both
11,8,Teresa Mendosa,Elmer Crider,8.0,6.0,9.0,3.0,5.0,5.0,4.0,7.0,both
12,8,Teresa Mendosa,Elmer Crider,8.0,6.0,4.0,1.0,3.0,7.0,0.0,0.0,both
13,8,Teresa Mendosa,Elmer Crider,8.0,2.0,7.0,6.0,7.0,6.0,3.0,5.0,both
14,8,Teresa Mendosa,Elmer Crider,8.0,2.0,6.0,1.0,3.0,0.0,5.0,7.0,both
15,9,Mary Bakley,Marcia Prieto,9.0,8.0,8.0,7.0,7.0,4.0,2.0,7.0,both
16,10,Sylvia Hardin,Clayton Arteaga,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,left_only
17,11,Israel Luster,Steven Lanier,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,left_only
18,12,Joel Underwood,Mary Coles,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,left_only

## 9. Anexar

In [30]:
# Se crea data frame para ejemplo
df1 = pd.DataFrame(np.random.randint(0,10,size = (8,8)), columns=list('ABCDEFGH'))
df1
df2 = pd.DataFrame(np.random.randint(20,25,size = (4,8)), columns=list('ABCDEFGH'))
df2
df3 = pd.DataFrame(np.random.randint(20,25,size = (4,8)), columns=list('CDEFGHIJ'))
df3

   A  B  C  D  E  F  G  H
0  5  1  1  6  4  2  9  0
1  4  2  6  0  6  6  4  4
2  9  7  8  4  2  3  5  0
3  5  0  9  5  0  6  3  1
4  8  7  3  3  4  0  5  7
5  5  4  1  4  1  5  5  6
6  2  3  3  7  7  3  1  1
7  2  8  1  9  5  4  2  4

    A   B   C   D   E   F   G   H
0  24  23  24  24  22  23  23  22
1  22  22  23  22  23  24  24  21
2  24  24  23  20  20  21  22  20
3  24  23  21  22  23  22  20  22

    C   D   E   F   G   H   I   J
0  20  23  20  22  22  23  23  22
1  23  22  24  20  21  24  21  21
2  24  22  20  22  20  20  23  24
3  24  24  21  24  24  21  23  20

In [31]:
#https://pandas.pydata.org/pandas-docs/stable/merging.html
resultado = pd.concat([df1,df2],join="outer", join_axes=None, ignore_index=False,
          keys=None, levels=None, names=None, verify_integrity=False,
          copy=True)
resultado

    A   B   C   D   E   F   G   H
0   5   1   1   6   4   2   9   0
1   4   2   6   0   6   6   4   4
2   9   7   8   4   2   3   5   0
3   5   0   9   5   0   6   3   1
4   8   7   3   3   4   0   5   7
5   5   4   1   4   1   5   5   6
6   2   3   3   7   7   3   1   1
7   2   8   1   9   5   4   2   4
0  24  23  24  24  22  23  23  22
1  22  22  23  22  23  24  24  21
2  24  24  23  20  20  21  22  20
3  24  23  21  22  23  22  20  22

In [32]:
#https://pandas.pydata.org/pandas-docs/stable/merging.html
resultado = pd.concat([df1,df2,df3],join="outer", join_axes=None, ignore_index=False,
          keys=["x","y","z"], levels=None, names=["Origen","ID"], verify_integrity=False,
          copy=True)
resultado

              A     B   C   D   E   F   G   H     I     J
Origen ID
x      0    5.0   1.0   1   6   4   2   9   0   NaN   NaN
       1    4.0   2.0   6   0   6   6   4   4   NaN   NaN
       2    9.0   7.0   8   4   2   3   5   0   NaN   NaN
       3    5.0   0.0   9   5   0   6   3   1   NaN   NaN
       4    8.0   7.0   3   3   4   0   5   7   NaN   NaN
       5    5.0   4.0   1   4   1   5   5   6   NaN   NaN
       6    2.0   3.0   3   7   7   3   1   1   NaN   NaN
       7    2.0   8.0   1   9   5   4   2   4   NaN   NaN
y      0   24.0  23.0  24  24  22  23  23  22   NaN   NaN
       1   22.0  22.0  23  22  23  24  24  21   NaN   NaN
       2   24.0  24.0  23  20  20  21  22  20   NaN   NaN
       3   24.0  23.0  21  22  23  22  20  22   NaN   NaN
z      0    NaN   NaN  20  23  20  22  22  23  23.0  22.0
       1    NaN   NaN  23  22  24  20  21  24  21.0  21.0
       2    NaN   NaN  24  22  20  22  20  20  23.0  24.0
       3    NaN   NaN  24  24  21  24  24  21  23.0  20.0

In [33]:
#https://pandas.pydata.org/pandas-docs/stable/merging.html

#Con inner

resultado = pd.concat([df1,df2,df3],join="inner", join_axes=None, ignore_index=False,
          keys=["x","y","z"], levels=None, names=["Origen","ID"], verify_integrity=False,
          copy=True)
resultado

            C   D   E   F   G   H
Origen ID
x      0    1   6   4   2   9   0
       1    6   0   6   6   4   4
       2    8   4   2   3   5   0
       3    9   5   0   6   3   1
       4    3   3   4   0   5   7
       5    1   4   1   5   5   6
       6    3   7   7   3   1   1
       7    1   9   5   4   2   4
y      0   24  24  22  23  23  22
       1   23  22  23  24  24  21
       2   23  20  20  21  22  20
       3   21  22  23  22  20  22
z      0   20  23  20  22  22  23
       1   23  22  24  20  21  24
       2   24  22  20  22  20  20
       3   24  24  21  24  24  21

In [34]:
#https://pandas.pydata.org/pandas-docs/stable/merging.html

#Con axis 1 para unir por filas 

resultado = pd.concat([df1,df2,df3],axis=1,join="inner", join_axes=None, ignore_index=False,
          keys=["x","y","z"], levels=None, names=["Origen","ID"], verify_integrity=False,
          copy=True)
resultado

Origen  x                        y     ...           z                      \
ID      A  B  C  D  E  F  G  H   A   B ...   G   H   C   D   E   F   G   H
0       5  1  1  6  4  2  9  0  24  23 ...  23  22  20  23  20  22  22  23
1       4  2  6  0  6  6  4  4  22  22 ...  24  21  23  22  24  20  21  24
2       9  7  8  4  2  3  5  0  24  24 ...  22  20  24  22  20  22  20  20
3       5  0  9  5  0  6  3  1  24  23 ...  20  22  24  24  21  24  24  21

Origen
ID       I   J
0       23  22
1       21  21
2       23  24
3       23  20

[4 rows x 24 columns]

## 10. Intervalos
https://pandas.pydata.org/pandas-docs/stable/generated/pandas.cut.html

In [35]:
#Se importa mismo set de datos que en R para comparar resultados

#!pip install pydataset
from pydataset import data
mtcars = data("mtcars")
mtcars.head()
mtcars.describe()
type(mtcars)

,mpg,cyl,disp,hp,drat,wt,qsec,vs,am,gear,carb
Mazda RX4,21.0,6,160.0,110,3.90,2.620,16.46,0,1,4,4
Mazda RX4 Wag,21.0,6,160.0,110,3.90,2.875,17.02,0,1,4,4
Datsun 710,22.8,4,108.0,93,3.85,2.320,18.61,1,1,4,1
Hornet 4 Drive,21.4,6,258.0,110,3.08,3.215,19.44,1,0,3,1
Hornet Sportabout,18.7,8,360.0,175,3.15,3.440,17.02,0,0,3,2

,mpg,cyl,disp,hp,drat,wt,qsec,vs,am,gear,carb
count,32.000000,32.000000,32.000000,32.000000,32.000000,32.000000,32.000000,32.000000,32.000000,32.000000,32.0000
mean,20.090625,6.187500,230.721875,146.687500,3.596563,3.217250,17.848750,0.437500,0.406250,3.687500,2.8125
std,6.026948,1.785922,123.938694,68.562868,0.534679,0.978457,1.786943,0.504016,0.498991,0.737804,1.6152
min,10.400000,4.000000,71.100000,52.000000,2.760000,1.513000,14.500000,0.000000,0.000000,3.000000,1.0000
25%,15.425000,4.000000,120.825000,96.500000,3.080000,2.581250,16.892500,0.000000,0.000000,3.000000,2.0000
50%,19.200000,6.000000,196.300000,123.000000,3.695000,3.325000,17.710000,0.000000,0.000000,4.000000,2.0000
75%,22.800000,8.000000,326.000000,180.000000,3.920000,3.610000,18.900000,1.000000,1.000000,4.000000,4.0000
max,33.900000,8.000000,472.000000,335.000000,4.930000,5.424000,22.900000,1.000000,1.000000,5.000000,8.0000

pandas.core.frame.DataFrame

pandas.cut(x, bins, right=True, labels=None, retbins=False, precision=3, include_lowest=False)

In [36]:
# Se parte variable mpg en 5 partes iguales
mpg_cat = pd.cut(mtcars["mpg"],5)
mpg_cat.describe()
mpg_cat.cat.categories
pd.concat([mtcars, mpg_cat],axis=1).head()

count               32
unique               5
top       (15.1, 19.8]
freq                12
Name: mpg, dtype: object

IntervalIndex([(10.376, 15.1], (15.1, 19.8], (19.8, 24.5], (24.5, 29.2], (29.2, 33.9]]
              closed='right',
              dtype='interval[float64]')

,mpg,cyl,disp,hp,drat,wt,qsec,vs,am,gear,carb,mpg
Mazda RX4,21.0,6,160.0,110,3.90,2.620,16.46,0,1,4,4,"(19.8, 24.5]"
Mazda RX4 Wag,21.0,6,160.0,110,3.90,2.875,17.02,0,1,4,4,"(19.8, 24.5]"
Datsun 710,22.8,4,108.0,93,3.85,2.320,18.61,1,1,4,1,"(19.8, 24.5]"
Hornet 4 Drive,21.4,6,258.0,110,3.08,3.215,19.44,1,0,3,1,"(19.8, 24.5]"
Hornet Sportabout,18.7,8,360.0,175,3.15,3.440,17.02,0,0,3,2,"(15.1, 19.8]"

In [37]:
# Se parte variable mpg en los valores introducidos
mpg_cat = pd.cut(mtcars["mpg"],[10,15,20,25,30],right=False, labels=["Cat1","Cat2", "Cat3","Cat4"]) #Adicionalmente se cambia el extremo que se inlcuye en el rango a que sea en la izquierda
mpg_cat.describe()
mpg_cat.cat.categories
pd.concat([mtcars, mpg_cat],axis=1).head()

count       28
unique       4
top       Cat2
freq        13
Name: mpg, dtype: object

Index(['Cat1', 'Cat2', 'Cat3', 'Cat4'], dtype='object')

,mpg,cyl,disp,hp,drat,wt,qsec,vs,am,gear,carb,mpg
Mazda RX4,21.0,6,160.0,110,3.90,2.620,16.46,0,1,4,4,Cat3
Mazda RX4 Wag,21.0,6,160.0,110,3.90,2.875,17.02,0,1,4,4,Cat3
Datsun 710,22.8,4,108.0,93,3.85,2.320,18.61,1,1,4,1,Cat3
Hornet 4 Drive,21.4,6,258.0,110,3.08,3.215,19.44,1,0,3,1,Cat3
Hornet Sportabout,18.7,8,360.0,175,3.15,3.440,17.02,0,0,3,2,Cat2

## 11. Partición

In [46]:

#Es similar a muestra, al tomarse una muestra de los índices de los registros
#Se utiliza set de datos mtcars de R


#Se define porcentaje para entrenamiento y prueba
entrenamiento = 0.75
prueba = 0.25

#Se redondea para el número de registros que es más cercano al porcentaje especificado. Hacia abajo
tam_muestra = np.floor(entrenamiento*mtcars.shape[0])
np.dtype(tam_muestra)
indicestotales = np.arange(mtcars.shape[0])
ind_entrenamiento = np.random.choice(indicestotales,int(tam_muestra),replace=False)

print("Ver índices")
ind_entrenamiento
ind_prueba = ~np.isin(indicestotales,ind_entrenamiento)
ind_prueba
df_entrenamiento = mtcars.iloc[ind_entrenamiento,]
df_entrenamiento
df_prueba = mtcars.iloc[ind_prueba,]
df_prueba

dtype('float64')

Ver índices

array([20, 28, 26, 23, 22,  0, 29,  7, 27,  9, 19, 13, 12, 15,  6,  4, 17,
       30, 18, 11,  1,  8, 31,  2])

array([False, False, False,  True, False,  True, False, False, False,
       False,  True, False, False, False,  True, False,  True, False,
       False, False, False,  True, False, False,  True,  True, False,
       False, False, False, False, False], dtype=bool)

,mpg,cyl,disp,hp,drat,wt,qsec,vs,am,gear,carb
Toyota Corona,21.5,4,120.1,97,3.70,2.465,20.01,1,0,3,1
Ford Pantera L,15.8,8,351.0,264,4.22,3.170,14.50,0,1,5,4
Porsche 914-2,26.0,4,120.3,91,4.43,2.140,16.70,0,1,5,2
Camaro Z28,13.3,8,350.0,245,3.73,3.840,15.41,0,0,3,4
AMC Javelin,15.2,8,304.0,150,3.15,3.435,17.30,0,0,3,2
Mazda RX4,21.0,6,160.0,110,3.90,2.620,16.46,0,1,4,4
Ferrari Dino,19.7,6,145.0,175,3.62,2.770,15.50,0,1,5,6
Merc 240D,24.4,4,146.7,62,3.69,3.190,20.00,1,0,4,2
Lotus Europa,30.4,4,95.1,113,3.77,1.513,16.90,1,1,5,2
Merc 280,19.2,6,167.6,123,3.92,3.440,18.30,1,0,4,4
Toyota Corolla,33.9,4,71.1,65,4.22,1.835,19.90,1,1,4,1
Merc 450SLC,15.2,8,275.8,180,3.07,3.780,18.00,0,0,3,3
Merc 450SL,17.3,8,275.8,180,3.07,3.730,17.60,0,0,3,3
Lincoln Continental,10.4,8,460.0,215,3.00,5.424,17.82,0,0,3,4
Duster 360,14.3,8,360.0,245,3.21,3.570,15.84,0,0,3,4
Hornet Sportabout,18.7,8,360.0,175,3.15,3.440,17.02,0,0,3,2
Fiat 128,32.4,4,78.7,66,4.08,2.200,19.47,1,1,4,1
Maserati Bora,15.0,8,301.0,335,3.54,3.570,14.60,0,1,5,8
Honda Civic,30.4,4,75.7,52,4.93,1.615,18.52,1,1,4,2
Merc 450SE,16.4,8,275.8,180,3.07,4.070,17.40,0,0,3,3
Mazda RX4 Wag,21.0,6,160.0,110,3.90,2.875,17.02,0,1,4,4
Merc 230,22.8,4,140.8,95,3.92,3.150,22.90,1,0,4,2
Volvo 142E,21.4,4,121.0,109,4.11,2.780,18.60,1,1,4,2
Datsun 710,22.8,4,108.0,93,3.85,2.320,18.61,1,1,4,1

,mpg,cyl,disp,hp,drat,wt,qsec,vs,am,gear,carb
Hornet 4 Drive,21.4,6,258.0,110,3.08,3.215,19.44,1,0,3,1
Valiant,18.1,6,225.0,105,2.76,3.460,20.22,1,0,3,1
Merc 280C,17.8,6,167.6,123,3.92,3.440,18.90,1,0,4,4
Cadillac Fleetwood,10.4,8,472.0,205,2.93,5.250,17.98,0,0,3,4
Chrysler Imperial,14.7,8,440.0,230,3.23,5.345,17.42,0,0,3,4
Dodge Challenger,15.5,8,318.0,150,2.76,3.520,16.87,0,0,3,2
Pontiac Firebird,19.2,8,400.0,175,3.08,3.845,17.05,0,0,3,2
Fiat X1-9,27.3,4,79.0,66,4.08,1.935,18.90,1,1,4,1

## 12. Transponer

In [39]:
df0.transpose()#con dataframe

A = np.array([[56.0,0.0,4.4,68.0],
             [1.2,104.0,52.0,8.0],
             [1.8,135.0,99.0,0.9]])
A

A.T #Con np array

                             0            1            2            3
copia_de_Ingresos         1000         2100         1500         3000
A                          NaN            2          NaN          NaN
B                            2            4          NaN            3
C                          NaN          NaN          NaN          NaN
D                          NaN            1            5            4
Ingresos                  1000         2100         1500         3000
Variable_nueva            2000         4200         3000         6000
Varnueva2                    1            2          NaN          1.5
Varnueva3                  500         1050          750         1500
Var4               Categoria 1  Categoria 2  Categoria 1  Categoria 2

array([[  56. ,    0. ,    4.4,   68. ],
       [   1.2,  104. ,   52. ,    8. ],
       [   1.8,  135. ,   99. ,    0.9]])

array([[  56. ,    1.2,    1.8],
       [   0. ,  104. ,  135. ],
       [   4.4,   52. ,   99. ],
       [  68. ,    8. ,    0.9]])

## 13. Agregar

In [40]:
#Se crea dataframe para ejemplo

df1 =  pd.DataFrame(np.random.randn(100, 4), columns=list('ABCD')) #dataframe con 4 columnas y 100 registros aleatorios con distribución normal
#Con un condicional
prueba=df1["A"]<0 #Condición almacenada como Pandas Series
#type(prueba)#Pandas Series
df1.loc[prueba, "Var4"]="Categoria 1" #En caso de cumplir
df1.loc[~prueba,"Var4"]="Categoria 2" #En caso de no cumplir, se invierten valores de boolean pandas series con el signo "~"
df1.head()

          A         B         C         D         Var4
0 -0.526011 -1.654683 -0.081622  0.924045  Categoria 1
1  2.985429 -1.273469  0.937778 -0.732266  Categoria 2
2 -0.134537 -0.640874  0.564201 -0.287284  Categoria 1
3  1.541289  0.587826  0.960255  2.450461  Categoria 2
4  0.264656  1.078038 -0.026636 -0.810740  Categoria 2

In [41]:
agregado = df1.groupby("Var4").describe() #Agregar usando describe paara obtener todos los estadísticos
agregado
type(agregado)

#Mejor forma para escoger valores cuando se tiene data frame MultiIndex
agregado.loc[:,(["A","B"],["count","mean"])]

#Para seleccionar todos los valores del índice de nombre de columnas
idx = pd.IndexSlice
agregado.loc[:, idx[:,["count","mean"]]]

                A                                                              \
            count      mean       std       min       25%       50%       75%
Var4
Categoria 1  52.0 -0.878944  0.667601 -2.919780 -1.261464 -0.837633 -0.335719
Categoria 2  48.0  0.856145  0.684847  0.046825  0.293482  0.739264  1.334564

                          B              ...            C               D  \
                  max count      mean    ...          75%       max count
Var4                                     ...
Categoria 1 -0.014324  52.0  0.005645    ...     0.623561  1.957013  52.0
Categoria 2  2.985429  48.0  0.245462    ...     0.766782  1.920299  48.0

                                                                         \
                 mean       std       min       25%       50%       75%
Var4
Categoria 1  0.289994  0.980811 -1.593798 -0.298408  0.286806  0.926668
Categoria 2  0.103693  1.006364 -2.363067 -0.602341  0.226459  0.827943


                  max
Var4
Categoria 1  2.680988
Categoria 2  2.450461

[2 rows x 32 columns]

pandas.core.frame.DataFrame

                A               B
            count      mean count      mean
Var4
Categoria 1  52.0 -0.878944  52.0  0.005645
Categoria 2  48.0  0.856145  48.0  0.245462

                A               B               C               D
            count      mean count      mean count      mean count      mean
Var4
Categoria 1  52.0 -0.878944  52.0  0.005645  52.0 -0.007646  52.0  0.289994
Categoria 2  48.0  0.856145  48.0  0.245462  48.0 -0.079217  48.0  0.103693

## 14. Otras Operaciones

### 14.1. Forma

In [42]:
df0.shape #dataframe
A.shape #np array

(4, 10)

(3, 4)

In [43]:
#Cambiar forma. FUNCIONA CON NP ARRAYS, no dataframes
A.reshape((2,6))

array([[  56. ,    0. ,    4.4,   68. ,    1.2,  104. ],
       [  52. ,    8. ,    1.8,  135. ,   99. ,    0.9]])

### 14.2. Vista previa

In [44]:
df1 =  pd.DataFrame(np.random.randn(100, 4), columns=list('ABCD')) #dataframe con 4 columnas y 100 registros
df1.head()#primeros 5
df1.head(10) #primeros 10

          A         B         C         D
0  0.117187 -0.568899 -0.210952  0.408086
1 -1.604985  0.168415  1.166699 -0.280982
2  0.810942 -0.916547 -0.077818  0.347665
3  1.824516  0.329526  1.335739 -0.210014
4 -0.907747  0.590055 -0.534764  1.435242

          A         B         C         D
0  0.117187 -0.568899 -0.210952  0.408086
1 -1.604985  0.168415  1.166699 -0.280982
2  0.810942 -0.916547 -0.077818  0.347665
3  1.824516  0.329526  1.335739 -0.210014
4 -0.907747  0.590055 -0.534764  1.435242
5  0.126743 -2.604733  0.487001  0.010700
6 -0.025239 -0.400803 -0.974382 -0.190073
7  1.105265 -0.237542 -0.510417  2.556426
8  0.926076 -1.319678  0.728162 -0.599988
9 -0.187085 -1.191999  1.292485  1.750860

### 14.3 MultiIndex
https://www.somebits.com/~nelson/pandas-multiindex-slice-demo.html